lustre-fio-analyze/fio_result.txt
readwrite: (g=0): rw=rw, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=16
...
fio-3.32
Starting 8 processes
readwrite: Laying out IO file (1 file / 2048MiB)
readwrite: Laying out IO file (1 file / 2048MiB)
readwrite: Laying out IO file (1 file / 2048MiB)
[...]

readwrite: (groupid=0, jobs=8): err= 0: pid=130431: Fri Sep 11 01:52:05 2026
  read: IOPS=1183, BW=1183MiB/s (1241MB/s)(1387GiB/1200126msec)
    slat (usec): min=76, max=40471, avg=886.01, stdev=2728.95
    clat (usec): min=1625, max=685266, avg=88049.74, stdev=63655.50
     lat (usec): min=1723, max=685381, avg=88935.75, stdev=63524.78
    clat percentiles (msec):
     |  1.00th=[   21],  5.00th=[   29], 10.00th=[   33], 20.00th=[   41],
     | 30.00th=[   48], 40.00th=[   57], 50.00th=[   68], 60.00th=[   82],
     | 70.00th=[  101], 80.00th=[  127], 90.00th=[  174], 95.00th=[  218],
     | 99.00th=[  321], 99.50th=[  363], 99.90th=[  443], 99.95th=[  477],
     | 99.99th=[  542]
   bw (  MiB/s): min=  226, max= 2048, per=100.00%, avg=1183.64, stdev=35.93, samples=19192
   iops        : min=  226, max= 2048, avg=1183.53, stdev=35.93, samples=19192
  write: IOPS=507, BW=507MiB/s (532MB/s)(595GiB/1200126msec); 0 zone resets
    slat (usec): min=106, max=4226, avg=188.22, stdev=56.66
    clat (usec): min=1417, max=634003, avg=44658.45, stdev=41140.80
     lat (usec): min=1554, max=634219, avg=44846.67, stdev=41141.53
    clat percentiles (msec):
     |  1.00th=[   12],  5.00th=[   17], 10.00th=[   20], 20.00th=[   24],
     | 30.00th=[   29], 40.00th=[   32], 50.00th=[   36], 60.00th=[   40],
     | 70.00th=[   45], 80.00th=[   53], 90.00th=[   69], 95.00th=[   93],
     | 99.00th=[  264], 99.50th=[  309], 99.90th=[  397], 99.95th=[  426],
     | 99.99th=[  493]
   bw (  KiB/s): min=32768, max=1079296, per=100.00%, avg=519694.29, stdev=20025.85, samples=19192
   iops        : min=   32, max= 1054, avg=507.47, stdev=19.55, samples=19192
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.15%, 20=3.72%, 50=41.88%
  lat (msec)   : 100=32.03%, 250=19.73%, 500=2.44%, 750=0.02%
  cpu          : usr=0.43%, sys=2.99%, ctx=1569120, majf=0, minf=96
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1420144,608916,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1183MiB/s (1241MB/s), 1183MiB/s-1183MiB/s (1241MB/s-1241MB/s), io=1387GiB (1489GB), run=1200126-1200126msec
  WRITE: bw=507MiB/s (532MB/s), 507MiB/s-507MiB/s (532MB/s-532MB/s), io=595GiB (638GB), run=1200126-1200126msec